oxidecomputer/DAPLink/source/hic_hal/nxp/lpc55xx/DAP_config.h
}

/** SWCLK/TCK I/O pin: Get Input.
\return Current status of the SWCLK/TCK DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_SWCLK_TCK_IN(void)
{
    return GPIO->B[PIN_PIO_PORT][PIN_TCK_SWCLK];
}

/** SWCLK/TCK I/O pin: Set Output to High.
Set the SWCLK/TCK DAP hardware I/O pin to high level.
*/
__STATIC_FORCEINLINE void     PIN_SWCLK_TCK_SET(void)
{
    GPIO->B[PIN_PIO_PORT][PIN_TCK_SWCLK] = 1;
}

/** SWCLK/TCK I/O pin: Set Output to Low.
Set the SWCLK/TCK DAP hardware I/O pin to low level.
*/
__STATIC_FORCEINLINE void     PIN_SWCLK_TCK_CLR(void)
{
    GPIO->B[PIN_PIO_PORT][PIN_TCK_SWCLK] = 0;
}


// SWDIO/TMS Pin I/O --------------------------------------

/** SWDIO/TMS I/O pin: Get Input.
\return Current status of the SWDIO/TMS DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_SWDIO_TMS_IN(void)
{
    return GPIO->B[PIN_PIO_PORT][PIN_TMS_SWDIO];
}

/** SWDIO/TMS I/O pin: Set Output to High.
Set the SWDIO/TMS DAP hardware I/O pin to high level.
*/
__STATIC_FORCEINLINE void     PIN_SWDIO_TMS_SET(void)
{
    GPIO->B[PIN_PIO_PORT][PIN_TMS_SWDIO] = 1;
}

/** SWDIO/TMS I/O pin: Set Output to Low.
Set the SWDIO/TMS DAP hardware I/O pin to low level.
*/
__STATIC_FORCEINLINE void     PIN_SWDIO_TMS_CLR(void)
{
    GPIO->B[PIN_PIO_PORT][PIN_TMS_SWDIO] = 0;
}

/** SWDIO I/O pin: Get Input (used in SWD mode only).
\return Current status of the SWDIO DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_SWDIO_IN(void)
{
    return GPIO->B[PIN_PIO_PORT][PIN_TMS_SWDIO];
}

/** SWDIO I/O pin: Set Output (used in SWD mode only).
\param bit Output value for the SWDIO DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE void     PIN_SWDIO_OUT(uint32_t bit)
{

    GPIO->B[PIN_PIO_PORT][PIN_TMS_SWDIO] = bit;
}

/** SWDIO I/O pin: Switch to Output mode (used in SWD mode only).
Configure the SWDIO DAP hardware I/O pin to output mode. This function is
called prior \ref PIN_SWDIO_OUT function calls.
*/
__STATIC_FORCEINLINE void     PIN_SWDIO_OUT_ENABLE(void)
{
    GPIO->DIRSET[PIN_PIO_PORT] = PIN_TMS_SWDIO_MASK;
    GPIO->B[PIN_PIO_PORT][PIN_TMS_SWDIO_TXEN] = 1;
}

/** SWDIO I/O pin: Switch to Input mode (used in SWD mode only).
Configure the SWDIO DAP hardware I/O pin to input mode. This function is
called prior \ref PIN_SWDIO_IN function calls.
*/
__STATIC_FORCEINLINE void     PIN_SWDIO_OUT_DISABLE(void)
{
    GPIO->B[PIN_PIO_PORT][PIN_TMS_SWDIO_TXEN] = 0;
    GPIO->DIRCLR[PIN_PIO_PORT] = PIN_TMS_SWDIO_MASK;
}


// TDI Pin I/O ---------------------------------------------

/** TDI I/O pin: Get Input.
\return Current status of the TDI DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_TDI_IN(void)
{
    return GPIO->B[PIN_PIO_PORT][PIN_TDI];
}

/** TDI I/O pin: Set Output.
\param bit Output value for the TDI DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE void     PIN_TDI_OUT(uint32_t bit)
{
    GPIO->B[PIN_PIO_PORT][PIN_TDI] = bit;
}


// TDO Pin I/O ---------------------------------------------

/** TDO I/O pin: Get Input.
\return Current status of the TDO DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_TDO_IN(void)
{
    return GPIO->B[PIN_PIO_PORT][PIN_TDO_SWO];
}


// nTRST Pin I/O -------------------------------------------

/** nTRST I/O pin: Get Input.
\return Current status of the nTRST DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_nTRST_IN(void)
{
    return (0);   // Not available
}

/** nTRST I/O pin: Set Output.
\param bit JTAG TRST Test Reset pin status:
           - 0: issue a JTAG TRST Test Reset.
           - 1: release JTAG TRST Test Reset.
*/
__STATIC_FORCEINLINE void     PIN_nTRST_OUT(uint32_t bit)
{
    ;             // Not available
}

// nRESET Pin I/O------------------------------------------

/** nRESET I/O pin: Get Input.
\return Current status of the nRESET DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_nRESET_IN(void)
{
    return GPIO->B[PIN_RESET_IN_PORT][PIN_RESET_IN];
}

/** nRESET I/O pin: Set Output.
\param bit target device hardware reset pin status:
           - 0: issue a device hardware reset.
           - 1: release device hardware reset.
*/
__STATIC_FORCEINLINE void     PIN_nRESET_OUT(uint32_t bit)
{
    // output is active high reset
    GPIO->B[PIN_PIO_PORT][PIN_RESET] = bit ? 0 : 1;
}

///@}


//**************************************************************************************************
/**
\defgroup DAP_Config_LEDs_gr CMSIS-DAP Hardware Status LEDs
\ingroup DAP_ConfigIO_gr
@{

CMSIS-DAP Hardware may provide LEDs that indicate the status of the CMSIS-DAP Debug Unit.

It is recommended to provide the following LEDs for status indication:
 - Connect LED: is active when the DAP hardware is connected to a debugger.
 - Running LED: is active when the debugger has put the target device into running state.
*/

/** Debug Unit: Set status of Connected LED.
\param bit status of the Connect LED.
           - 1: Connect LED ON: debugger is connected to CMSIS-DAP Debug Unit.
           - 0: Connect LED OFF: debugger is not connected to CMSIS-DAP Debug Unit.
*/
__STATIC_INLINE void LED_CONNECTED_OUT(uint32_t bit)
{
    gpio_set_leds(LED_T_CONNECTED, bit ? GPIO_LED_ON : GPIO_LED_OFF);
}

/** Debug Unit: Set status Target Running LED.
\param bit status of the Target Running LED.
           - 1: Target Running LED ON: program execution in target started.
           - 0: Target Running LED OFF: program execution in target stopped.
*/
__STATIC_INLINE void LED_RUNNING_OUT(uint32_t bit)
{
    gpio_set_leds(LED_T_RUNNING, bit ? GPIO_LED_ON : GPIO_LED_OFF);
}

///@}


//**************************************************************************************************
/**
\defgroup DAP_Config_Timestamp_gr CMSIS-DAP Timestamp
\ingroup DAP_ConfigIO_gr
@{
Access function for Test Domain Timer.

The value of the Test Domain Timer in the Debug Unit is returned by the function \ref TIMESTAMP_GET. By
default, the DWT timer is used.  The frequency of this timer is configured with \ref TIMESTAMP_CLOCK.

*/

/** Get timestamp of Test Domain Timer.
\return Current timestamp value.
*/
__STATIC_INLINE uint32_t TIMESTAMP_GET (void) {
  return (DWT->CYCCNT) / (CPU_CLOCK / TIMESTAMP_CLOCK);
}

///@}


//**************************************************************************************************
/**
\defgroup DAP_Config_Initialization_gr CMSIS-DAP Initialization
\ingroup DAP_ConfigIO_gr
@{

CMSIS-DAP Hardware I/O and LED Pins are initialized with the function \ref DAP_SETUP.
*/

/** Setup of the Debug Unit I/O pins and LEDs (called when Debug Unit is initialized).
This function performs the initialization of the CMSIS-DAP Hardware I/O Pins and the
Status LEDs. In detail the operation of Hardware I/O and LED pins are enabled and set:
 - I/O clock system enabled.
 - all I/O pins: input buffer enabled, output pins are set to HighZ mode.
 - for nTRST, nRESET a weak pull-up (if available) is enabled.
 - LED output pins are enabled and LEDs are turned off.
*/
__STATIC_INLINE void DAP_SETUP(void)
{
    // Configure pins.
    static const iocon_group_t kPinConfigs[] = {
        {
            .port = PIN_PIO_PORT,
            .pin = PIN_TCK_SWCLK,
            .modefunc = IOCON_FUNC0
                      | IOCON_SLEW_FAST
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_PIO_PORT,
            .pin = PIN_TMS_SWDIO,
            .modefunc = IOCON_FUNC0
                      | IOCON_SLEW_FAST
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_PIO_PORT,
            .pin = PIN_TMS_SWDIO_TXEN,
            .modefunc = IOCON_FUNC0
                      | IOCON_SLEW_STANDARD
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_PIO_PORT,
            .pin = PIN_TDO_SWO,
            .modefunc = IOCON_FUNC0
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_SWD_EN_PORT,
            .pin = PIN_SWD_EN,
            .modefunc = IOCON_FUNC0
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_PIO_PORT,
            .pin = PIN_RESET,
            .modefunc = IOCON_FUNC0
                      | IOCON_SLEW_STANDARD
                      | IOCON_DIGITAL_EN
                      | IOCON_GPIO_MODE // I2C pins are special
        },
        {
            .port = PIN_PIO_PORT,
            .pin = PIN_RESET_IN,
            .modefunc = IOCON_FUNC0
                      | IOCON_DIGITAL_EN
                      | IOCON_GPIO_MODE // I2C pins are special
        },
        {
            .port = PIN_SPI_CS_L_PORT,
            .pin = PIN_SPI_CS_L,
            .modefunc = IOCON_FUNC0
                      | IOCON_SLEW_STANDARD
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_SPI_CRESET_PORT,
            .pin = PIN_SPI_CRESET,
            .modefunc = IOCON_FUNC0
                      | IOCON_SLEW_STANDARD
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_SPI_EN_PORT,
            .pin = PIN_SPI_EN,
            .modefunc = IOCON_FUNC0
                      | IOCON_SLEW_STANDARD
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_SPI_CDONE_PORT,
            .pin = PIN_SPI_CDONE,
            .modefunc = IOCON_FUNC0
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_SPI_SCK_PORT,
            .pin = PIN_SPI_SCK,
            .modefunc = IOCON_FUNC7
                      | IOCON_SLEW_FAST
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_SPI_MOSI_PORT,
            .pin = PIN_SPI_MOSI,
            .modefunc = IOCON_FUNC7
                      | IOCON_SLEW_FAST
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_SPI_MISO_PORT,
            .pin = PIN_SPI_MISO,
            .modefunc = IOCON_FUNC7
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_VREF_TARGET_SPI_PORT,
            .pin = PIN_VREF_TARGET_SPI,
            .modefunc = IOCON_FUNC0
                      | IOCON_ANALOG_EN
                      | IOCON_AWS_EN
        },
        {
            .port = PIN_VREF_TARGET_UART_PORT,
            .pin = PIN_VREF_TARGET_UART,
            .modefunc = IOCON_FUNC0
                      | IOCON_ANALOG_EN
                      | IOCON_AWS_EN
        },
        {
            .port = PIN_VREF_TARGET_SWD_PORT,
            .pin = PIN_VREF_TARGET_SWD,
            .modefunc = IOCON_FUNC0
                      | IOCON_ANALOG_EN
                      | IOCON_AWS_EN
        },
        {
            .port = PIN_UART_STATUS_LED_PORT,
            .pin = PIN_UART_STATUS_LED,
            .modefunc = IOCON_FUNC0
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_SWD_STATUS_LED_PORT,
            .pin = PIN_SWD_STATUS_LED,
            .modefunc = IOCON_FUNC0
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_UC_STATUS_LED_PORT,
            .pin = PIN_UC_STATUS_LED,
            .modefunc = IOCON_FUNC0
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_HCV0_PORT,
            .pin = PIN_HCV0,
            .modefunc = IOCON_FUNC0
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_HCV1_PORT,
            .pin = PIN_HCV1,
            .modefunc = IOCON_FUNC0
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_HCV2_PORT,
            .pin = PIN_HCV2,
            .modefunc = IOCON_FUNC0
                      | IOCON_DIGITAL_EN
        },
        {
            .port = PIN_PROBE_ID_PORT,
            .pin = PIN_PROBE_ID,
            .modefunc = IOCON_FUNC0
                      | IOCON_DIGITAL_EN
        },
    };

    IOCON_SetPinMuxing(IOCON, kPinConfigs, ARRAY_SIZE(kPinConfigs));

