oxidecomputer/DAPLink/source/hic_hal/nxp/lpc55xx/DAP_config.h
    // Configure GPIO outputs.
    // set high
    GPIO->SET[PIN_PIO_PORT] = PIN_SPI_CS_L_MASK
                            | PIN_UART_EN_MASK
                            | PIN_SPI_CRESET_MASK;

    // set low
    GPIO->CLR[PIN_PIO_PORT] = PIN_SWD_EN_MASK
                            | PIN_SPI_EN_MASK
                            | PIN_RESET_MASK
                            | PIN_TMS_SWDIO_TXEN_MASK;

    // Set GPIO directions.
    // TODO cleanup port assumption

    // set outputs
    GPIO->DIRSET[PIN_PIO_PORT] = PIN_SPI_CRESET_MASK
                               | PIN_SPI_CS_L_MASK
                               | PIN_SWD_EN_MASK
                               | PIN_UART_EN_MASK
                               | PIN_SPI_EN_MASK
                               | PIN_RESET_MASK
                               | PIN_TMS_SWDIO_TXEN_MASK
                               | PIN_SWD_STATUS_LED_MASK
                               | PIN_UART_STATUS_LED_MASK
                               | PIN_UC_STATUS_LED_MASK;

    // set inputs
    GPIO->DIRCLR[PIN_PIO_PORT] = PIN_SPI_CDONE_MASK
                               | PIN_RESET_IN_MASK
                               | PIN_TMS_SWDIO_MASK
                               | PIN_VREF_TARGET_SPI
                               | PIN_VREF_TARGET_SWD
                               | PIN_VREF_TARGET_UART;

    spi_master_config_t userConfig;
    userConfig.baudRate_Bps = 1000000;

    CLOCK_AttachClk(kFRO12M_to_FLEXCOMM7);
    SPI_MasterGetDefaultConfig(&userConfig);
    SPI_MasterInit(SPI7, &userConfig, 12000000);
}

/** Reset Target Device with custom specific I/O pin or command sequence.
This function allows the optional implementation of a device specific reset sequence.
It is called when the command \ref DAP_ResetTarget and is for example required
when a device needs a time-critical unlock sequence that enables the debug port.
\return 0 = no device specific reset sequence is implemented.\n
        1 = a device specific reset sequence is implemented.
*/
__STATIC_INLINE uint32_t RESET_TARGET(void)
{
    return (0);              // change to '1' when a device reset sequence is implemented
}

///@}


#endif /* __DAP_CONFIG_H__ */
